// الخطوة 2: انشاء ملف الحالة (State) الخاص بالـ Cubit اللي بيكون فيه كل الحالات المختلفة اللي ممكن تكون عليها عملية اضافة نوت جديدة
// هنا بنعرف الحالات المختلفة اللي ممكن تكون عليها عملية اضافة نوت جديدة
// مهم جدا: كل حالة من الحالات دي هتمثل حالة معينة للاضافة بتاعت النوت
// مثلا: حالة البداية، حالة التحميل، حالة النجاح، وحالة الفشل
// كل حالة من الحالات دي هتكون عبارة عن كلاس منفصل بيورث من الكلاس الاب AddNoteState
// الهدف من تعريف الحالات دي هو اننا نقدر نتحكم في واجهة المستخدم بناءً على الحالة الحالية للعملية
// مثلا: لو العملية في حالة تحميل، نعرض مؤشر تحميل، ولو نجحت نعرض رسالة نجاح، ولو فشلت نعرض رسالة خطأ
// كمان مهم نعرف ان الحالات دي هتستخدم في الـ Cubit اللي هيكون مسؤول عن عملية اضافة النوت الجديدة
// وبالتالي نقدر نغير الحالة بناءً على نتيجة العملية
// في النهاية، تعريف الحالات دي بيساعدنا في تنظيم الكود وجعله أكثر وضوحًا وسهولة في الصيانة
// كود الحالات المختلفة لاضافة نوت جديدة:
// ## عند بناء الحالات دي، بنستخدم الكلمة المفتاحية "abstract" عشان نعرف ان الكلاس الاب مش هيتم انشاؤه بشكل مباشر
// ## وبنستخدم الكلمة المفتاحية "extends" عشان نعرف ان الكلاسات الابناء بيرثوا من الكلاس الاب AddNoteState


abstract class AddNoteState {}

class AddNoteInitial extends AddNoteState {}

class AddNoteLoading extends AddNoteState {}

class AddNoteSuccess extends AddNoteState {}

class AddNoteFailure extends AddNoteState {
  final String errMessage;

  AddNoteFailure(this.errMessage);
}
